
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Validation 🤖`success`
  #### Terraform Plan 📖`success`

  <details><summary>Show Plan</summary>

  ```terraform
  Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/miwataru/dev/runs/run-ADcnbuirKfdaKS5f

Waiting for the plan to start...

Terraform v1.2.1
on linux_amd64
Initializing plugins and modules...
module.db.random_password.master_password[0]: Refreshing state... [id=none]
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-054d5779d010989b8]
aws_ssm_parameter.aws_region: Refreshing state... [id=/Miwataru/dev/AWS_REGION]
module.db.module.db_instance.data.aws_partition.current: Reading...
data.aws_route53_zone.root: Reading...
aws_s3_bucket.main: Refreshing state... [id=miwataru-dev]
aws_ssm_parameter.db_password: Refreshing state... [id=/Miwataru/dev/DB_PASSWORD]
aws_iam_user.smtp: Refreshing state... [id=ses-smtp-user.20210920-091305]
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=1813475199]
module.db.module.db_option_group.aws_db_option_group.this[0]: Refreshing state... [id=miwataru-dev-20210920080001175600000001]
module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=miwataru-dev-20210920080001178100000002]
module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=miwataru-dev-rds-monitoring-role]
aws_iam_user_policy.smtp: Refreshing state... [id=ses-smtp-user.20210920-091305:AmazonSesSendingAccess]
aws_iam_access_key.smtp: Refreshing state... [id=AKIA35TYW75FECNS7OEX]
aws_ssm_parameter.smtp_username: Refreshing state... [id=/Miwataru/dev/MAIL_USERNAME]
aws_ssm_parameter.smtp_password: Refreshing state... [id=/Miwataru/dev/MAIL_PASSWORD]
aws_ssm_parameter.s3_bucket: Refreshing state... [id=/Miwataru/dev/S3_BUCKET]
module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=miwataru-dev-rds-monitoring-role-20210920080010152100000003]
module.vpc.aws_subnet.private[3]: Refreshing state... [id=subnet-0b08f7702d507d0bd]
module.vpc.aws_subnet.private[4]: Refreshing state... [id=subnet-0e0875c25e8156cd4]
module.vpc.aws_subnet.private[5]: Refreshing state... [id=subnet-071250b4303eea156]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-04108694ca880bba6]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0f968d813e1c5b416]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0edd934303422ecfe]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-05923333112f6a290]
module.vpc.aws_route_table.private[3]: Refreshing state... [id=rtb-0092ecabe1ea9087c]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0d3bdf02adddda9dd]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0926d6fe4968748df]
module.vpc.aws_route_table.private[5]: Refreshing state... [id=rtb-0dccc10e940081330]
module.vpc.aws_route_table.private[4]: Refreshing state... [id=rtb-067e6cd082dc0166a]
module.security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-04ea1e44345920b30]
data.aws_route53_zone.root: Read complete after 0s [id=Z04139543XONVZYFSV5O]
aws_vpc_endpoint.dynamodb: Refreshing state... [id=vpce-0a3945950d49aa65b]
aws_ses_domain_identity.root: Refreshing state... [id=miwataru.com]
aws_route53_record.www: Refreshing state... [id=Z04139543XONVZYFSV5O_www.miwataru.com_CNAME]
aws_ssm_parameter.hosted_zone_id: Refreshing state... [id=/Miwataru/dev/HOSTED_ZONE_ID]
module.acm.aws_acm_certificate.this[0]: Refreshing state... [id=arn:aws:acm:us-east-1:819518177098:certificate/d1277b7a-dd1b-40f4-9f9d-00d65abb04fc]
aws_ssm_parameter.domain_name: Refreshing state... [id=/Miwataru/dev/DOMAIN_NAME]
aws_route53_record.root: Refreshing state... [id=Z04139543XONVZYFSV5O_miwataru.com_A]
module.security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3384045530]
module.security_group.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-1637708421]
aws_ssm_parameter.security_group_id: Refreshing state... [id=/Miwataru/dev/SECURITY_GROUP_ID]
module.security_group.aws_security_group_rule.ingress_with_self[1]: Refreshing state... [id=sgrule-748899794]
module.vpc.aws_route_table_association.private[5]: Refreshing state... [id=rtbassoc-07e599267e35e55ab]
module.vpc.aws_route_table_association.private[4]: Refreshing state... [id=rtbassoc-0f435afb7445245b8]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-06b20d4fd47d79c3f]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0979cb25c589ce616]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0a6e1de74c46c3aa2]
module.vpc.aws_route_table_association.private[3]: Refreshing state... [id=rtbassoc-052782dabca2f24fe]
aws_vpc_endpoint.ses: Refreshing state... [id=vpce-0ce90f25ceb9100d2]
aws_ssm_parameter.private_subnets: Refreshing state... [id=/Miwataru/dev/PRIVATE_SUBNET_IDS]
aws_ses_domain_dkim.root: Refreshing state... [id=miwataru.com]
module.db.module.db_subnet_group.aws_db_subnet_group.this[0]: Refreshing state... [id=miwataru-dev-20210920080020224700000004]
module.acm.aws_route53_record.validation[0]: Refreshing state... [id=Z04139543XONVZYFSV5O__aa8df122035f827ae9dc1d06c29502de.miwataru.com._CNAME]
aws_route53_record.root_amazonses_dkim_record[1]: Refreshing state... [id=Z04139543XONVZYFSV5O_ubbfsfq46s4jsdfl7x6ovv6bjzztkc6e._domainkey_CNAME]
aws_route53_record.root_amazonses_dkim_record[0]: Refreshing state... [id=Z04139543XONVZYFSV5O_2lg6listzlkgivnon2qc6kybjy6w6vxb._domainkey_CNAME]
aws_route53_record.root_amazonses_dkim_record[2]: Refreshing state... [id=Z04139543XONVZYFSV5O_ljsht6i3x72zurlozfkb3xpeoyvforom._domainkey_CNAME]
module.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=miwataru-dev]
module.acm.aws_acm_certificate_validation.this[0]: Refreshing state... [id=2021-09-12 14:03:52 +0000 UTC]
aws_ssm_parameter.db_name: Refreshing state... [id=/Miwataru/dev/DB_DATABASE]
aws_ssm_parameter.db_username: Refreshing state... [id=/Miwataru/dev/DB_USERNAME]
aws_ssm_parameter.db_address: Refreshing state... [id=/Miwataru/dev/DB_HOST]
aws_ssm_parameter.certificate_name: Refreshing state... [id=/Miwataru/dev/CERTIFICATE_ARN]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.acm.aws_acm_certificate.this[0] has changed
  ~ resource "aws_acm_certificate" "this" {
        id                        = "arn:aws:acm:us-east-1:819518177098:certificate/d1277b7a-dd1b-40f4-9f9d-00d65abb04fc"
      ~ subject_alternative_names = [
          + "*.miwataru.com",
        ]
        tags                      = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_subnet.private[0] has changed
  ~ resource "aws_subnet" "private" {
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
        id                                             = "subnet-0edd934303422ecfe"
      + ipv6_native                                    = false
      + private_dns_hostname_type_on_launch            = "ip-name"
        tags                                           = {
            "Name" = "main-vpc-private-us-east-1a"
        }
        # (10 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] has changed
  ~ resource "aws_subnet" "private" {
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
        id                                             = "subnet-04108694ca880bba6"
      + ipv6_native                                    = false
      + private_dns_hostname_type_on_launch            = "ip-name"
        tags                                           = {
            "Name" = "main-vpc-private-us-east-1b"
        }
        # (10 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[2] has changed
  ~ resource "aws_subnet" "private" {
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
        id                                             = "subnet-0f968d813e1c5b416"
      + ipv6_native                                    = false
      + private_dns_hostname_type_on_launch            = "ip-name"
        tags                                           = {
            "Name" = "main-vpc-private-us-east-1c"
        }
        # (10 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[3] has changed
  ~ resource "aws_subnet" "private" {
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
        id                                             = "subnet-0b08f7702d507d0bd"
      + ipv6_native                                    = false
      + private_dns_hostname_type_on_launch            = "ip-name"
        tags                                           = {
            "Name" = "main-vpc-private-us-east-1d"
        }
        # (10 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[4] has changed
  ~ resource "aws_subnet" "private" {
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
        id                                             = "subnet-0e0875c25e8156cd4"
      + ipv6_native                                    = false
      + private_dns_hostname_type_on_launch            = "ip-name"
        tags                                           = {
            "Name" = "main-vpc-private-us-east-1e"
        }
        # (10 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[5] has changed
  ~ resource "aws_subnet" "private" {
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
        id                                             = "subnet-071250b4303eea156"
      + ipv6_native                                    = false
      + private_dns_hostname_type_on_launch            = "ip-name"
        tags                                           = {
            "Name" = "main-vpc-private-us-east-1f"
        }
        # (10 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket_acl.main will be created
  + resource "aws_s3_bucket_acl" "main" {
      + acl    = "private"
      + bucket = "miwataru-dev"
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # aws_s3_bucket_versioning.main will be created
  + resource "aws_s3_bucket_versioning" "main" {
      + bucket = "miwataru-dev"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_ssm_parameter.db_address will be updated in-place
  ~ resource "aws_ssm_parameter" "db_address" {
        id          = "/Miwataru/dev/DB_HOST"
        name        = "/Miwataru/dev/DB_HOST"
        tags        = {}
      ~ value       = (sensitive value)
      ~ version     = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_ssm_parameter.db_name will be updated in-place
  ~ resource "aws_ssm_parameter" "db_name" {
        id          = "/Miwataru/dev/DB_DATABASE"
        name        = "/Miwataru/dev/DB_DATABASE"
        tags        = {}
      ~ value       = (sensitive value)
      ~ version     = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_ssm_parameter.db_password will be updated in-place
  ~ resource "aws_ssm_parameter" "db_password" {
        id              = "/Miwataru/dev/DB_PASSWORD"
        name            = "/Miwataru/dev/DB_PASSWORD"
        tags            = {}
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_vpc_endpoint.ses will be created
  + resource "aws_vpc_endpoint" "ses" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-04ea1e44345920b30",
        ]
      + service_name          = "com.amazonaws.us-east-1.email-smtp"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-0edd934303422ecfe",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-054d5779d010989b8"
    }

  # module.db.random_password.master_password[0] must be replaced
-/+ resource "random_password" "master_password" {
      ~ bcrypt_hash = (sensitive value)
      ~ id          = "none" -> (known after apply)
      ~ length      = 10 -> 16 # forces replacement
      ~ result      = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # module.db.module.db_instance.aws_db_instance.this[0] must be replaced
-/+ resource "aws_db_instance" "this" {
      ~ address                               = "miwataru-dev.cfjusfwfqz6l.us-east-1.rds.amazonaws.com" -> (known after apply)
      ~ arn                                   = "arn:aws:rds:us-east-1:819518177098:db:miwataru-dev" -> (known after apply)
      ~ availability_zone                     = "us-east-1c" -> (known after apply)
      ~ ca_cert_identifier                    = "rds-ca-2019" -> (known after apply)
      ~ character_set_name                    = "" -> (known after apply)
      - customer_owned_ip_enabled             = false -> null
      ~ db_subnet_group_name                  = "miwataru-dev-20210920080020224700000004" -> (known after apply)
      - domain                                = "" -> null
      - domain_iam_role_name                  = "" -> null
      ~ endpoint                              = "miwataru-dev.cfjusfwfqz6l.us-east-1.rds.amazonaws.com:3306" -> (known after apply)
      ~ engine_version_actual                 = "10.4.21" -> (known after apply)
      ~ hosted_zone_id                        = "Z2R2ITUGPM61AM" -> (known after apply)
      ~ id                                    = "miwataru-dev" -> (known after apply)
      ~ identifier_prefix                     = "" -> (known after apply)
      ~ kms_key_id                            = "" -> (known after apply)
      ~ latest_restorable_time                = "2022-05-29T04:50:00Z" -> (known after apply)
      ~ license_model                         = "general-public-license" -> (known after apply)
      ~ name                                  = "miwataru_dev" -> (known after apply)
      ~ nchar_character_set_name              = "" -> (known after apply)
      ~ password                              = (sensitive value)
      ~ performance_insights_kms_key_id       = "" -> (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
      ~ replica_mode                          = "" -> (known after apply)
      ~ replicas                              = [] -> (known after apply)
      - replicate_source_db                   = "" -> null
      ~ resource_id                           = "db-TGDDGRES3J2CDDD3ZMGKSHLDU4" -> (known after apply)
      - security_group_names                  = [] -> null
      + snapshot_identifier                   = (known after apply)
      ~ status                                = "available" -> (known after apply)
      ~ storage_encrypted                     = false -> true # forces replacement
      - tags                                  = {
          - "Name" = "miwataru-dev"
        } -> null
      ~ tags_all                              = {
          - "Name" = "miwataru-dev"
        } -> (known after apply)
      ~ timezone                              = "" -> (known after apply)
        # (31 unchanged attributes hidden)

      ~ timeouts {
          - create = "40m" -> null
          - delete = "40m" -> null
          - update = "80m" -> null
        }
    }

  # module.db.module.db_subnet_group.aws_db_subnet_group.this[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_db_subnet_group" "this" {
      - arn         = "arn:aws:rds:us-east-1:819518177098:subgrp:miwataru-dev-20210920080020224700000004" -> null
      - description = "miwataru-dev subnet group" -> null
      - id          = "miwataru-dev-20210920080020224700000004" -> null
      - name        = "miwataru-dev-20210920080020224700000004" -> null
      - name_prefix = "miwataru-dev-" -> null
      - subnet_ids  = [
          - "subnet-04108694ca880bba6",
          - "subnet-071250b4303eea156",
          - "subnet-0b08f7702d507d0bd",
          - "subnet-0e0875c25e8156cd4",
          - "subnet-0edd934303422ecfe",
          - "subnet-0f968d813e1c5b416",
        ] -> null
      - tags        = {
          - "Name" = "miwataru-dev"
        } -> null
      - tags_all    = {
          - "Name" = "miwataru-dev"
        } -> null
    }

Plan: 5 to add, 3 to change, 3 to destroy.
╷
│ Warning: Redundant ignore_changes element
│ 
│   on .terraform/modules/db/modules/db_instance/main.tf line 26, in resource "aws_db_instance" "this":
│   26: resource "aws_db_instance" "this" {
│ 
│ Adding an attribute name to ignore_changes tells Terraform to ignore future
│ changes to the argument in configuration after the object has been created,
│ retaining the value originally configured.
│ 
│ The attribute latest_restorable_time is decided by the provider alone and
│ therefore there can be no configured value to compare with. Including this
│ attribute in ignore_changes has no effect. Remove the attribute from
│ ignore_changes to quiet this warning.
╵

  ```

  </details>

  *Pusher: @zuka-e, Action: `pull_request`*
